// @file
//
//Copyright (c) 2006 - 2011, Byosoft Corporation.<BR> 
//All rights reserved.This software and associated documentation (if any)
//is furnished under a license and may only be used or copied in 
//accordance with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be reproduced, 
//stored in a retrieval system, or transmitted in any form or by any 
//means without the express written consent of Byosoft Corporation.
//
//File Name:
//  TpmSetup.uni
//
//Abstract: 
//  setup part of TPM Module.
//
//Revision History:
//
//Bug 3128 - Move Tpm setup module part from SnbClientX64Pkg to ByoModulePkg.
//TIME: 2011-11-21
//$AUTHOR: Zhang Lin
//$REVIEWERS: 
//$SCOPE: SugarBay
//$TECHNICAL: 
//  1. dynamic insert setup package to let it be independent with Platform.
//$END--------------------------------------------------------------------
//
//


///*++
//Copyright (c) 2010 Intel Corporation. All rights reserved.
//This software and associated documentation (if any) is furnished
//under a license and may only be used or copied in accordance
//with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be
//reproduced, stored in a retrieval system, or transmitted in any
//form or by any means without the express written consent of
//Intel Corporation.
//
//Module Name:
//
//  TcgSetup.uni
//
//Abstract:
//
// TcgSetup  Setup strings.
//--*/
/=#

#langdef   en-US "en-USlish"
#langdef   fr-FR "Français"

// TPM 
#string STR_TPM_TITLE                      #language en-US "TPM"
#string STR_TPM_HELP                       #language en-US "Press <Enter> to select the TPM Setup options."
#string STR_TPM_DEVICE_PROMPT              #language en-US "  TPM Enable State"
#string STR_TPM_DEVICE_HELP                #language en-US "Enable/Disable the TPM device."
#string STR_TPM_STATE_PROMPT               #language en-US "  TPM Activate State"
#string STR_TPM_STATE_HELP                 #language en-US "Activate/Deactivate the TPM device, setting takes effect on the next boot."
#string STR_ACTIVATE                       #language en-US "Activate"
#string STR_DEACTIVATE                     #language en-US "Deactivate"
#string STR_TPM_FORCE_CLEAR_PROMPT         #language en-US "  Force TPM Clear"
#string STR_TPM_FORCE_CLEAR_HELP           #language en-US "Force Clear TPM data, setting takes effect on the next boot."
#string STR_MOR_PROMPT                     #language en-US "MOR State"
#string STR_MOR_HELP                       #language en-US "Enable/Disable the MOR (Memory Overwrite Request) feature"
#string STR_TPM_PHYSICAL_PRESENCE_LOCKED   #language en-US "TPM Device (Locked)"
#string STR_TPM_PHYSICAL_PRESENCE_UNLOCKED #language en-US "TPM Device (Unlocked)"
#string STR_TPM_PHYSICAL_PRESENCE_LOCK_PROMPT #language en-US "  TPM Physical Presence Lock"
#string STR_TPM_PHYSICAL_PRESENCE_LOCK_HELP   #language en-US "Enable/Disable TPM Physical Presence Lock"
#string STR_NULL_STRING                    #language en-US ""

// Enable or Disable
#string STR_ENABLE                         #language en-US  "Enable"
#string STR_DISABLE                        #language en-US  "Disable"
#string STR_AUTO                           #language en-US  "Auto"
#string STR_EMPTY                          #language en-US  ""